<?php

use Illuminate\Database\Seeder;
use App\Model\Position;
use App\Model\Project;
use App\Model\ProjectActivity;
use App\Model\Department;
use App\Model\Employee;
use App\Model\Role;

class AddOatSampleData extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
      // Set format data
      $departments = [
        ['code' =>'100', 'name' => 'งานส่วนกลาง'],
        ['code' =>'101', 'name' => 'ฝ่ายบัญชีและการเงิน'],
        ['code' =>'102', 'name' => 'ฝ่ายเทคโนโลยีสารสนเทศ'],
        ['code' =>'103', 'name' => 'ฝ่ายทรัพยากรธรณี'],
        ['code' =>'104', 'name' => 'ฝ่ายวิศวกรรม'],
        ['code' =>'105', 'name' => 'ฝ่ายทรัพยากรน้ำบาดาล'],
        ['code' =>'106', 'name' => 'ฝ่ายสิ่งแวดล้อม'],
        ['code' =>'107', 'name' => 'ฝ่ายบริหารกลาง'],
        ['code' =>'000', 'name' => 'อื่นๆ'],
      ];

      $positions = [
        ['name' => 'นักธรณีวิทยา', 'department_code' => 103],
        ['name' => 'นักวิทยาศาสตร์สิ่งแวดล้อม', 'department_code' => 106],
        ['name' => 'นักสารสนเทศภูมิศาสตร์', 'department_code' => 100],
        ['name' => 'นักสำรวจ', 'department_code' => 103],
        ['name' => 'นักอุทกธรณีวิทยา', 'department_code' => 106],
        ['name' => 'ผู้จัดการฝ่าย'],
        ['name' => 'ผู้ช่วยนักสำรวจ', 'department_code' => 105],
        ['name' => 'ผู้ช่วยผู้จัดการฝ่าย'],
        ['name' => 'พนักงานขับรถ', 'department_code' => 107],
        ['name' => 'พนักงานคอมพิวเตอร์', 'department_code' => 100],
        ['name' => 'พนักงานจัดซื้อและพัสดุ'],
        ['name' => 'ช่างซ่อมบำรุงและบริการทั่วไป', 'department_code' => 107],
        ['name' => 'พนักงานบัญชี'],
        ['name' => 'พนักงานรักษาความปลอดภัย'],
        ['name' => 'พนักงานส่งเอกสาร', 'department_code' => 107],
        ['name' => 'หัวหน้าแผนก'],
        ['name' => 'หัวหน้าศูนย์'],
        ['name' => 'พนักงานบุคคลและสวัสดิการ'],
        ['name' => 'ผู้ช่วยกรรมการผู้จัดการ'],
        ['name' => 'ประธานกรรมการบริษัท', 'department_code' => 100],
        ['name' => 'ประธานกรรมการบริหาร'],
        ['name' => 'กรรมการผู้จัดการ', 'department_code' => 100],
        ['name' => 'ที่ปรึกษา'],
        ['name' => 'ผู้ช่วยกรรมการผู้จัดการ (ธรณีวิทยา)' , 'department_code' => 100],
        ['name' => 'ผู้ช่วยกรรมการผู้จัดการ (วิศวกรรม)' , 'department_code' => 100],
        ['name' => 'เลขาฯ ประธานกรรมการบริหาร', 'department_code' => 100],
        ['name' => 'เลขาฯ กรรมการผู้จัดการ', 'department_code' => 100],
        ['name' => 'ที่ปรึกษาอาวุโสประจำบริษัท', 'department_code' => 100],
        ['name' => 'ที่ปรึกษาประจำบริษัท', 'department_code' => 100],
        ['name' => 'ผู้จัดการฝ่ายบัญชีและการเงิน', 'department_code' => 101],
        ['name' => 'หัวหน้าแผนกบัญชีและงบประมาณ', 'department_code' => 101],
        ['name' => 'ผู้ช่วยผู้จัดการฝ่ายเทคโนโลยีสารสนเทศ', 'department_code' => 102],
        ['name' => 'ผู้จัดการฝ่ายทรัพยากรธรณี', 'department_code' => 103],
        ['name' => 'ผู้ช่วยผู้จัดการฝ่ายทรัพยากรธรณี', 'department_code' => 103],
        ['name' => 'นักธรณีวิทยาอาวุโส', 'department_code' => 103],
        ['name' => 'ธุรการประจำฝ่ายทรัพยากรธรณี', 'department_code' => 103],
        ['name' => 'ผู้จัดการฝ่ายวิศวกรรม', 'department_code' => 104],
        ['name' => 'ธุรการประจำฝ่ายวิศวกรรม', 'department_code' => 104],
        ['name' => 'ผู้จัดการฝ่ายทรัพยากรน้ำ', 'department_code' => 105],
        ['name' => 'ธุรการประจำฝ่ายทรัพยากรน้ำ', 'department_code' => 105],
        ['name' => 'นักธรณีวิทยา และ รักษาการหัวหน้าแผนกอุทกธรณีวิทยา', 'department_code' => 105],
        ['name' => 'ผู้จัดการฝ่ายสิ่งแวดล้อม', 'department_code' => 106],
        ['name' => 'วิศวกรสิ่งแวดล้อม', 'department_code' => 106],
        ['name' => 'หัวหน้าแผนกการจัดการสิ่งแวดล้อม', 'department_code' => 106],
        ['name' => 'ผู้จัดการฝ่ายบริหารกลาง', 'department_code' => 107],
        ['name' => 'ผช. ฝบก. และเลขาฯ ปก.', 'department_code' => 107],
        ['name' => 'หัวหน้าแผนกบริการ', 'department_code' => 107],
        ['name' => 'เจ้าหน้าที่รักษาความปลอดภัย', 'department_code' => 107],
        ['name' => 'แม่บ้าน', 'department_code' => 107],
        ['name' => 'หัวหน้าแผนกจัดซื้อและพัสดุ', 'department_code' => 107],
      ];

      $employees = [
        'employee_id' => ['พป.001','พป.110','พป.034','พป.240','พป.201','พป.097','พส.312','master1','master2','พป.035','พป.211','พป.189','พป.242','พป.247','master3','พป.241','พส.433','พส.437','พส.443','พส.415','พป.243','พป.244','พส.432','พส.444','พป.213','พส.349','พส.358','พส.369','พส.375','พส.389','พส.434','พส.391','พป.235','พส.357','พป.147','พส.412','พป.199','พส.307','พป.029','พส.322','พส.333','พป.246','พส.399','พส.400','พส.411','พส.427','พส.429','พส.426','พส.440','พป.245','พส.424','พป.248','พส.402','พส.418','พส.419','พส.425','พส.441','พส.442','พป.174','พป.249','พป.173','พป.117','พป.171','พส.317','พส.341','พส.378','พส.409','พส.414','พส.430','พส.438','พส.439','พป.033'],
        'fullname'    => [['firstname' => 'นายวิชัย', 'lastname' =>   'ภู่เจริญ'],['firstname' => 'นายธเนศ', 'lastname' =>    'ผกากรอง'],['firstname' => 'นายวิชาญ', 'lastname' =>   'อรุณศรีแสงไชย'],['firstname' => 'นายพุทธพล', 'lastname' =>    'ผลฉาย'],['firstname' => 'นางพรรณนิภา', 'lastname' =>  'หารัญดา'],['firstname' => 'นางสาวอัศณีย์', 'lastname' =>  'เชาวน์วิไล'],['firstname' => 'นางสาวรพีพรรณ', 'lastname' =>  'ภิรมย์วงศ์'],['firstname' => 'นายสุธรรม', 'lastname' =>  'แย้มนิยม'],['firstname' => 'นางงามพิศ', 'lastname' =>  'แย้มนิยม'],['firstname' => 'นายอรุณ', 'lastname' =>  'ไตรตระหง่าน'],['firstname' => 'นายสงวนศักดิ์', 'lastname' =>  'สังขบูรณ์'],['firstname' => 'นายพรพงศ์', 'lastname' =>  'อัศวดรเดชา'],['firstname' => 'นางณัฐกฤตา', 'lastname' =>   'ธนเจริญบวร'],['firstname' => 'นายคุณเดช', 'lastname' =>  'ฉายวงษ์'],['firstname' => 'นายณฐพพล', 'lastname' =>   'ภู่เจริญ'],['firstname' => 'นายนัธทวัฒน์', 'lastname' =>   'ราศรี'],['firstname' => 'นายจารุกิตติ์', 'lastname' =>  'แสนพลสิทธิ์'],['firstname' => 'นางสาวดวงพร', 'lastname' =>  'แสงจันทร์'],['firstname' => 'นางสาวสุปราณี', 'lastname' =>  'อินทร์สำราญ'],['firstname' => 'นางสาววิชชุดา', 'lastname' =>  'กิจวิรี'],['firstname' => 'นายเกื้อกูล', 'lastname' =>  'มะโหธร'],['firstname' => 'นายภมร', 'lastname' =>   'โสงขุนทด'],['firstname' => 'นายสุเรกณ์', 'lastname' =>   'กองใจ'],['firstname' => 'นางสาวธนัชพร', 'lastname' =>   'จันทร์วัง'],['firstname' => 'นายชัยวัฒน์', 'lastname' =>  'ประทีป ณ ถลาง'],['firstname' => 'นายวัชรพล', 'lastname' =>  'เคหา'],['firstname' => 'นายอาคม', 'lastname' =>  'อมรใฝ่ยุทธนา'],['firstname' => 'นายธนากร', 'lastname' =>   'ไชยวงค์'],['firstname' => 'นายอนันตรัช', 'lastname' =>  'อรรณพานุรักษ์'],['firstname' => 'นายจิระพัฒน์', 'lastname' =>   'ฤทธิ์เจริญ'],['firstname' => 'นายเตชินท์', 'lastname' =>   'มหาชน'],['firstname' => 'นางสาวอารียา', 'lastname' =>   'กลีบพิกุล'],['firstname' => 'นายเอกรินทร์', 'lastname' =>   'แมะกัน'],['firstname' => 'นายภาคภูมิ', 'lastname' =>   'เรือนจันทร์'],['firstname' => 'นายเฉลิมเกียรติ', 'lastname' =>  'ปลาทอง'],['firstname' => 'นางสาววิกาญดา', 'lastname' =>  'ดวงแก้ว'],['firstname' => 'นายสมบูรณ์', 'lastname' =>   'ลูกเหล็ม'],['firstname' => 'นายอนุภัทร', 'lastname' =>   'จันทร์เรีย'],['firstname' => 'นายคมสันต์', 'lastname' =>   'ทองวงษ์'],['firstname' => 'นายเนติ', 'lastname' =>  'ควรเอี่ยม'],['firstname' => 'นางสาวทิพวรรณ', 'lastname' =>  'อริยะดิษฐ'],['firstname' => 'นางสาวภัทรภร', 'lastname' =>   'สุบินนาม'],['firstname' => 'นายอนุพงษ์', 'lastname' =>   'ครุฑน้อย'],['firstname' => 'นายเอกนรินทร์', 'lastname' =>  'นินท์ธนศักดิ์'],['firstname' => 'นางสาวสุชีรา', 'lastname' =>   'ทุมกลาง'],['firstname' => 'นายวิรุฬห์', 'lastname' =>   'โพธิสิทธิ์'],['firstname' => 'นายอภิสิทธิ์', 'lastname' =>   'มะเด็ง'],['firstname' => 'นายศุภากร', 'lastname' =>  'สีแดง'],['firstname' => 'นายอภิวัฒน์', 'lastname' =>  'ป้อมสันเทียะ'],['firstname' => 'นายรณกร', 'lastname' =>  'วงศ์แสนสุข'],['firstname' => 'นายอนุสรณ์', 'lastname' =>   'สุพรม'],['firstname' => 'นางสาวรัชนี', 'lastname' =>  'ธนะวดี'],['firstname' => 'นางสาวจิรวรรณ', 'lastname' =>  'ธำรงศรีสกุล'],['firstname' => 'นางสาวอภิญญา', 'lastname' =>   'อินจันทร์'],['firstname' => 'นางสาวสุภาพร', 'lastname' =>   'ขอวางกลาง'],['firstname' => 'นายอนุกูล', 'lastname' =>  'คมกล้า'],['firstname' => 'นายชโลธร', 'lastname' =>   'อู่แก้ว'],['firstname' => 'นายเกรียงไกร', 'lastname' =>   'ประชุมชัย'],['firstname' => 'นางสาวพวงรัตน์', 'lastname' =>   'ขุนทอง'],['firstname' => 'นางสาวอรอนงค์', 'lastname' =>  'โมราสุทธิ์'],['firstname' => 'นายวีระวุธ', 'lastname' =>   'นุ้ยเมือง'],['firstname' => 'นายชัยสิทธิ์', 'lastname' =>   'พงษ์จันทร์'],['firstname' => 'นายอินทร', 'lastname' =>   'มิยะ'],['firstname' => 'นายทอง', 'lastname' =>   'บุญเลิศ'],['firstname' => 'นายเด็จ', 'lastname' =>  'จันที'],['firstname' => 'นางสาวไพวรรณ', 'lastname' =>   'ฉลองภาค'],['firstname' => 'นายสมโภชน์', 'lastname' =>   'คล้ายแก้ว'],['firstname' => 'นายเจษฎา', 'lastname' =>   'พลันการ'],['firstname' => 'นายพลตรี', 'lastname' =>   'ศรีสะอาด'],['firstname' => 'นายชัยพร', 'lastname' =>   'ปันแก้ว'],['firstname' => 'นายสมพงษ์', 'lastname' =>  'สิทธิสา'],['firstname' => 'นางอัมพันธ์', 'lastname' =>  'ปานเกษม']],
        'department_id' => ['100','100','100','100','100','100','100','100','100','100','100','100','101','101','100','102','102','102','102','102','103','103','103','103','103','103','103','103','103','103','104','104','104','104','105','105','105','105','105','105','105','105','105','105','105','105','105','105','105','106','106','106','106','106','106','106','106','106','107','107','107','107','107','107','107','107','107','107','107','107','107','107'],
        'position_name' => ['ประธานกรรมการบริษัท','ประธานกรรมการบริหาร','กรรมการผู้จัดการ','ผู้ช่วยกรรมการผู้จัดการ (ธรณีวิทยา)','ผู้ช่วยกรรมการผู้จัดการ (วิศวกรรม)','เลขาฯ ประธานกรรมการบริหาร','เลขาฯ กรรมการผู้จัดการ','ที่ปรึกษาอาวุโสประจำบริษัท','ที่ปรึกษาอาวุโสประจำบริษัท','ที่ปรึกษาอาวุโสประจำบริษัท','ที่ปรึกษาอาวุโสประจำบริษัท','ที่ปรึกษาประจำบริษัท','ผู้จัดการฝ่ายบัญชีและการเงิน','หัวหน้าแผนกบัญชีและงบประมาณ','ที่ปรึกษาประจำบริษัท','ผู้ช่วยผู้จัดการฝ่ายเทคโนโลยีสารสนเทศ','นักสารสนเทศภูมิศาสตร์','นักสารสนเทศภูมิศาสตร์','นักสารสนเทศภูมิศาสตร์','พนักงานคอมพิวเตอร์','ผู้จัดการฝ่ายทรัพยากรธรณี','ผู้ช่วยผู้จัดการฝ่ายทรัพยากรธรณี','นักธรณีวิทยาอาวุโส','ธุรการประจำฝ่ายทรัพยากรธรณี','นักสำรวจ','นักธรณีวิทยา','นักธรณีวิทยา','นักธรณีวิทยา','นักธรณีวิทยา','นักธรณีวิทยา','ผู้จัดการฝ่ายวิศวกรรม','ธุรการประจำฝ่ายวิศวกรรม','นักธรณีวิทยา','นักธรณีวิทยา','ผู้จัดการฝ่ายทรัพยากรน้ำ','ธุรการประจำฝ่ายทรัพยากรน้ำ','นักสำรวจ','นักสำรวจ','ผู้ช่วยนักสำรวจ','นักธรณีวิทยา','นักธรณีวิทยา','นักธรณีวิทยา และ รักษาการหัวหน้าแผนกอุทกธรณีวิทยา','นักธรณีวิทยา','นักธรณีวิทยา','นักธรณีวิทยา','นักธรณีวิทยา','ผู้ช่วยนักสำรวจ','นักสารสนเทศภูมิศาสตร์','นักสารสนเทศภูมิศาสตร์','ผู้จัดการฝ่ายสิ่งแวดล้อม','วิศวกรสิ่งแวดล้อม','หัวหน้าแผนกการจัดการสิ่งแวดล้อม','นักธรณีวิทยา','นักอุทกธรณีวิทยา','นักอุทกธรณีวิทยา','นักวิทยาศาสตร์สิ่งแวดล้อม','นักวิทยาศาสตร์สิ่งแวดล้อม','นักวิทยาศาสตร์สิ่งแวดล้อม','ผู้จัดการฝ่ายบริหารกลาง','ผช. ฝบก. และเลขาฯ ปก.','หัวหน้าแผนกบริการ','พนักงานขับรถ','พนักงานขับรถ','เจ้าหน้าที่รักษาความปลอดภัย','พนักงานขับรถ','แม่บ้าน','พนักงานส่งเอกสาร','ช่างซ่อมบำรุงและบริการทั่วไป','พนักงานขับรถ','พนักงานขับรถ','พนักงานขับรถ','หัวหน้าแผนกจัดซื้อและพัสดุ']
      ];

      $projects = [
        'code' => ['GMT 100','GMT 101','GMT 102','GMT 103','GMT 104','GMT 105','GMT 106','GMT 107','GMT 672','GMT 674','GMT 677','GMT 690','GMT 692'],
        'name' => ['งานส่วนกลาง','ฝ่ายบัญชีและการเงิน','ฝ่ายเทคโนโลยีสารสนเทศ','ฝ่ายทรัพยากรธรณี','ฝ่ายวิศวกรรม','ฝ่ายทรัพยากรน้ำบาดาล','ฝ่ายสิ่งแวดล้อม','ฝ่ายบริหารกลาง','โครงการศึกษา สำรวจและจัดทำแผนที่น้ำบาดาลขั้นรายละเอียดมาตราส่วน 1:50,000 พื้นที่ภาคตะวันออกเฉียงเหนือตอนล่าง พื้นที่ 3','โครงการสำรวจและศึกษาค่าพื้นฐานโลหะหนักในน้ำบาดาล ในพื้นที่ภาคกลางและภาคตะวันออก','งานสำรวจธรณีฟิสิกส์ด้วยวิธีวัดค่าความต้านทานไฟฟ้าจำเพาะ (resistivity survey) โครงการศึกษาสำรวจและจัดทำแผนที่น้ำบาดาลขั้นรายละเอียด มาตราส่วน 1:50,000 พื้นที่ภาคตะวันออกเฉียงเหนือตอนล่าง พื้นที่ 3','Geotechnical Investigation for fifth Transmission Pipeline Project Consultancy Services for Conceptual Study and Preliminary Design','งานเจาะสำรวจอ่างเก็บน้ำน้ำกอน อำเภอเชียงกลาง และน้ำกิ อำเภอท่าวังผา จังหวัดน่าน'],
        'department_code' => [100,101,102,103,104,105,106,107,105,106,105,104,103]
      ];

      $activities = [
        'project_code' => ['GMT 100','GMT 100','GMT 100','GMT 100','GMT 100','GMT 101','GMT 101','GMT 102','GMT 102','GMT 102','GMT 102','GMT 102','GMT 102','GMT 103','GMT 103','GMT 103','GMT 103','GMT 103','GMT 103','GMT 104','GMT 104','GMT 104','GMT 104','GMT 104','GMT 104','GMT 105','GMT 105','GMT 105','GMT 105','GMT 105','GMT 105','GMT 106','GMT 106','GMT 106','GMT 106','GMT 106','GMT 106','GMT 107','GMT 107','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672','GMT 672'],
        'sequence' => [1,1,1,1,1,1,1,1,1,2,2,3,3,1,1,2,2,3,3,1,1,2,2,3,3,1,1,2,2,3,3,1,1,2,2,3,3,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,4,4,4,4,4,4,4,5,5,5,5,5,5,5],
        'sub' => ['01','02','03','04','05','01','02','01','02','01','02','01','02','01','02','01','02','01','02','01','02','01','02','01','02','01','02','01','02','01','02','01','02','01','02','01','02','01','02','01','02','03','04','05','06','07','01','02','03','04','05','06','07','08','09','10','11','12','13','14','15','16','01','02','03','04','05','06','07','08','09','10','11','12','13','14','01','02','03','04','05','06','07','08','09','10','11','12','13','14','01','02','03','04','05','06','07','01','02','03','04','05','06','07'],
        'name' => ['งานประจำฝ่าย','ประชุมฝ่าย','ประชุมความก้าวหน้า','จัดทำข้อเสนองาน','อบรมและสัมมนา','งานประจำฝ่าย','ประชุมฝ่าย','งานประจำฝ่าย','ประชุมฝ่าย','พบลูกค้า','จัดทำข้อเสนอทางเทคนิคและราคา','ว่าง','โครงการส่วนตัว (โปรดระบุ)','งานประจำฝ่าย','ประชุมฝ่าย','พบลูกค้า','จัดทำข้อเสนอทางเทคนิคและราคา','ว่าง','โครงการส่วนตัว (โปรดระบุ)','งานประจำฝ่าย','ประชุมฝ่าย','พบลูกค้า','จัดทำข้อเสนอทางเทคนิคและราคา','ว่าง','โครงการส่วนตัว (โปรดระบุ)','งานประจำฝ่าย','ประชุมฝ่าย','พบลูกค้า','จัดทำข้อเสนอทางเทคนิคและราคา','ว่าง','โครงการส่วนตัว (โปรดระบุ)','งานประจำฝ่าย','ประชุมฝ่าย','พบลูกค้า','จัดทำข้อเสนอทางเทคนิคและราคา','ว่าง','โครงการส่วนตัว (โปรดระบุ)','งานประจำฝ่าย','ประชุมฝ่าย','รายงานความก้าวหน้าครั้งที่ 1 (inception report)','รายงานความก้าวหน้าครั้งที่ 2 (prog 1)','รายงานความก้าวหน้าครั้งที่ 3 (prog 2)','รายงานความก้าวหน้าครั้งที่ 4 (prog 3)','รายงานความก้าวหน้าครั้งที่ 5 (prog 4)','ร่างรายงานฉบับสมบูรณ์ (Draft Final Report)','รายงานฉบับสมบูรณ์ (Final Report)','ศึกษา รวบรวมและวิเคราะห์ข้อมูลทุติยภูมิ ','สูบทดสอบปริมาณน้ำ (บ่อน้ำบาดาลเดิม) 250 บ่อ  ','หยั่งธรณีหลุมเจาะโดยใช้ Gamma Ray Log 250 บ่อ  ','เจาะบ่อสำรวจแบบเก็บตัวอย่างตะกอนเศษหิน  20 บ่อ 3000 ม ','เจาะและก่อสร้างบ่อสังเกตการณ์ 20 บ่อ 1200 ม ','วิเคราะห์ ดิน หิน ตัวอย่าง ทุกระยะ 1  เมตร 4,200 เมตร ','หยั่งธรณีฟิสิกส์ในหลุมเจาะของบ่อเจาะสำรวจใหม่และบ่อสังเกตการณ์ 43 บ่อ ','จัดทำรั้วสำหรับบ่อสังเกตการณ์  20 บ่อ ','สูบทดสอบปริมาณน้ำบ่อเจาะใหม่ 20 บ่อ ','เก็บตัวอย่างน้ำบาดาล 40 ตัวอย่าง (บ่อเจาะสำรวจ 20 ตย บ่อสังเกตการณ์ 20 ตย)  ','วิเคราะห์ แปลความหมายและประมวลผลข้อมูลต่างๆ  ','จัดทำระดับชั้นข้อมูลสารสนเทศทางอุทกธรณีวิทยา  ','จัดทำแผนที่อุทกธรณีวิทยาและแผนที่น้ำบาดาล ','จัดทำระบบฐานข้อมูลสารสนเทศทางอุทกธรณีวิทยา','พิมพ์แผนที่อุทกธรณีวิทยาและแผนที่น้ำบาดาล  ','ขับรถรับส่ง','สำรวจการใช้น้ำบาดาลและความต้องการใช้น้ำบาดาล 750 หมู่บ้าน','การสำรวจสถานภาพบ่อน้ำบาดาล 1500 บ่อ ','การสำรวจธรณีฟิสิกส์บนผิวดิน ตามรูปแบบชลัมเบอร์เจอร์ 1750 จุด','การสำรวจธรณีฟิสิกส์บนผิวดินแบบภาคตัดขวาง 750 จุด ','เจาะบ่อสำรวจแบบเก็บแท่งตัวอย่างหิน  450 เมตร ','วิเคราะห์ ดิน หิน ตัวอย่าง ทุกระยะ 1  เมตร 450 เมตร ','รังวัดปากบ่อแบบ GPS ไม่น้อยกว่า 1,540 บ่อ ','วิเคราะห์ แปลความหมายและประมวลผลข้อมูลต่างๆ  ','จัดทำระดับชั้นข้อมูลสารสนเทศทางอุทกธรณีวิทยา   ','ฝึกอบรมภายในประเทศโปรแกรมคอม 3 มิติ  ','จัดทำแผนที่อุทกธรณีวิทยาและแผนที่น้ำบาดาล  ','ประชุมสัมมนาโครงการครั้งที่ 1','ประชุมสัมมนาโครงการครั้งที่ 2 ','พิมพ์แผนที่อุทกธรณีวิทยาและแผนที่น้ำบาดาล  ','สำรวจการใช้น้ำบาดาลและความต้องการใช้น้ำบาดาล 750 หมู่บ้าน','การสำรวจสถานภาพบ่อน้ำบาดาล 1500 บ่อ ','การสำรวจธรณีฟิสิกส์บนผิวดิน ตามรูปแบบชลัมเบอร์เจอร์ 1750 จุด','การสำรวจธรณีฟิสิกส์บนผิวดินแบบภาคตัดขวาง 750 จุด ','เจาะบ่อสำรวจแบบเก็บแท่งตัวอย่างหิน  450 เมตร ','วิเคราะห์ ดิน หิน ตัวอย่าง ทุกระยะ 1  เมตร 450 เมตร ','รังวัดปากบ่อแบบ GPS ไม่น้อยกว่า 1,540 บ่อ ','วิเคราะห์ แปลความหมายและประมวลผลข้อมูลต่างๆ  ','จัดทำระดับชั้นข้อมูลสารสนเทศทางอุทกธรณีวิทยา   ','ฝึกอบรมภายในประเทศโปรแกรมคอม 3 มิติ  ','จัดทำแผนที่อุทกธรณีวิทยาและแผนที่น้ำบาดาล  ','ประชุมสัมมนาโครงการครั้งที่ 1','ประชุมสัมมนาโครงการครั้งที่ 2 ','พิมพ์แผนที่อุทกธรณีวิทยาและแผนที่น้ำบาดาล  ','รายงานความก้าวหน้าครั้งที่ 1','ประชุมตรวจรับงานที่กรมทรัพยากรน้ำบาดาล','ประชุมโครงการ/ฝ่าย','ประชุมระดับฝ่าย','ประชุมความก้าวหน้า','ติดต่อ ประสานงาน','จัดทำรายงานความก้าวหน้าประจำเดือน','จัดทำภาคผนวกข้อมูลงานสนาม','จัดทำแฟ้มข้อมูลดิบข้อมูลงานสนาม','ตรวจสอบข้อมูลงานสนาม','งานแบบจำลองทางอุทกธรณีวิทยา','จัดทำฐานข้อมูลแบบจำลองฯ','จัดทำและประมวลผลแบบจำลองฯ','งานเอกสารต่าง ๆ ในโครงการ']
      ];

      $newActivities = [
        ['GMT 672', '1', '1',   'รายงานความก้าวหน้าครั้งที่ 1 (inception report)', '2016-01-01',  '2016-12-31'],
        ['GMT 672', '1', '2',   'รายงานความก้าวหน้าครั้งที่ 2 (prog 1)',   '2016-01-01',  '2016-12-31'],
        ['GMT 672', '1', '3',   'รายงานความก้าวหน้าครั้งที่ 3 (prog 2)',   '2016-01-01',  '2016-12-31'],
        ['GMT 672', '1', '4',   'รายงานความก้าวหน้าครั้งที่ 4 (prog 3)',   '2016-01-01',  '2016-12-31'],
        ['GMT 672', '1', '5',   'รายงานความก้าวหน้าครั้งที่ 5 (prog 4)',   '2016-01-01',  '2016-12-31'],
        ['GMT 672', '1', '6',   'ร่างรายงานฉบับสมบูรณ์ (Draft Final Report)',  '2016-01-01',  '2016-12-31'],
        ['GMT 672', '1', '7',   'รายงานฉบับสมบูรณ์ (Final Report)',    '2016-01-01',  '2016-12-31'],
        ['GMT 672', '1', '8',   'รายงานฉบับผู้บริหาร', '2016-01-01',  '2016-12-31'],
        ['GMT 672', '1', '9',   'จัดทำรายงานความก้าวหน้าประจำเดือน',   '2016-01-01',  '2016-12-31'],
        ['GMT 672', '1', '10',  'จัดทำภาคผนวก หรือแฟ้มข้อมูลดิบข้อมูลงานสนาม', '2016-01-01',  '2016-12-31'],
        ['GMT 672', '1', '1',   'งานศึกษา รวบรวมและวิเคราะห์ข้อมูลทุติยภูมิ',  '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '2',   'งานสำรวจการใช้น้ำบาดาลและความต้องการใช้น้ำบาดาล 750 หมู่บ้าน',    '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '3',   'งานสำรวจสถานภาพบ่อน้ำบาดาล 1500 บ่อ',     '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '4',   'งานสำรวจธรณีฟิสิกส์บนผิวดิน ตามรูปแบบชลัมเบอร์เจอร์ 1750 จุด',    '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '5',   'งานสำรวจธรณีฟิสิกส์บนผิวดินแบบภาคตัดขวาง 750 จุด',    '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '6',   'งานสูบทดสอบปริมาณน้ำ (บ่อน้ำบาดาลเดิม) 250 บ่อ',      '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '7',   'งานหยั่งธรณีหลุมเจาะโดยใช้ Gamma Ray Log 250 บ่อ',    '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '8',   'งานเจาะบ่อสำรวจแบบเก็บตัวอย่างตะกอนเศษหิน  20 บ่อ 3000 เมตร', '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '9',   'งานเจาะและก่อสร้างบ่อสังเกตการณ์ 20 บ่อ 1200 ม',  '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '10',  'งานวิเคราะห์ ดิน หิน ตัวอย่าง ทุกระยะ 1  เมตร 4,200 เมตร',    '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '11',  'งานหยั่งธรณีฟิสิกส์ในหลุมเจาะของบ่อเจาะสำรวจใหม่และบ่อสังเกตการณ์ 43 บ่อ',    '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '12',  'งานจัดทำรั้วสำหรับบ่อสังเกตการณ์  20 บ่อ',    '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '13',  'งานสูบทดสอบปริมาณน้ำบ่อเจาะใหม่ 20 บ่อ',  '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '14',  'งานเก็บตัวอย่างน้ำบาดาล 40 ตัวอย่าง (บ่อเจาะสำรวจ 20 ตย บ่อสังเกตการณ์ 20 ตย)',   '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '15',  'งานเจาะบ่อสำรวจแบบเก็บแท่งตัวอย่างหิน  450 เมตร',     '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '16',  'งานวิเคราะห์ ดิน หิน ตัวอย่างจากการเจาะบ่อสำรวจแบบเก็บแท่งตัวอย่างหิน ทุกระยะ 1  เมตร 450 เมตร',  '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '17',  'งานรังวัดปากบ่อแบบ GPS ไม่น้อยกว่า 1,540 บ่อ',    '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '18',  'งานตรวจสอบข้อมูลงานสนาม', '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '19',  'ขับรถรับส่งในสนาม',   '2016-01-01',  '2016-12-31'],
        ['GMT 672', '2', '1',   'งานวิเคราะห์ แปลความหมายและประมวลผลข้อมูลต่างๆ',      '2016-01-01',  '2016-12-31'],
        ['GMT 672', '3', '2',   'งานจัดทำระดับชั้นข้อมูลสารสนเทศทางอุทกธรณีวิทยา',     '2016-01-01',  '2016-12-31'],
        ['GMT 672', '3', '3',   'งานฝึกอบรมภายในประเทศโปรแกรมคอม 3 มิติ',      '2016-01-01',  '2016-12-31'],
        ['GMT 672', '3', '4',   'งานจัดทำแผนที่อุทกธรณีวิทยาและแผนที่น้ำบาดาล',    '2016-01-01',  '2016-12-31'],
        ['GMT 672', '3', '5',   'งานพิมพ์แผนที่อุทกธรณีวิทยาและแผนที่น้ำบาดาล',    '2016-01-01',  '2016-12-31'],
        ['GMT 672', '3', '6',   'งานจัดทำระบบฐานข้อมูลสารสนเทศทางอุทกธรณีวิทยา',   '2016-01-01',  '2016-12-31'],
        ['GMT 672', '3', '7',   'งานแบบจำลองทางอุทกธรณีวิทยา', '2016-01-01',  '2016-12-31'],
        ['GMT 672', '3', '8',   'จัดทำฐานข้อมูลแบบจำลองทางอุทกธรณีวิทยา',  '2016-01-01',  '2016-12-31'],
        ['GMT 672', '3', '9',   'จัดทำและประมวลผลแบบจำลองทางอุทกธรณีวิทยา',    '2016-01-01',  '2016-12-31'],
        ['GMT 672', '3', '10',  'ประชุมสัมมนาโครงการครั้งที่ 1',   '2016-01-01',  '2016-12-31'],
        ['GMT 672', '3', '11',  'ประชุมสัมมนาโครงการครั้งที่ 2',   '2016-01-01',  '2016-12-31'],
        ['GMT 672', '4', '1',   'ประชุมเสนอแผนงาน  ตรวจรับงานที่กรมทรัพยากรน้ำบาดาล',  '2016-01-01',  '2016-12-31'],
        ['GMT 672', '4', '2',   'ประชุมโครงการ',   '2016-01-01',  '2016-12-31'],
        ['GMT 672', '4', '3',   'ติดต่อ ประสานงาน',    '2016-01-01',  '2016-12-31'],
        ['GMT 674', '1', '1',   'การวางแผนการดำเนินงานโครงการฯ',   '2016-01-01',  '2016-12-31'],
        ['GMT 674', '1', '2',   'การประชุมภายในโครงการฯ',  '2016-01-01',  '2016-12-31'],
        ['GMT 674', '1', '3',   'การตรวจสอบการดำเนินงานภาคสนาม',   '2016-01-01',  '2016-12-31'],
        ['GMT 674', '1', '4',   'การจัดทำรายรับ-รายจ่าย (สุทธิ) โครงการฯ', '2016-01-01',  '2016-12-31'],
        ['GMT 674', '1', '5',   'การจัดทำเอกสารประชุมความก้าวหน้าโครงการฯ',    '2016-01-01',  '2016-12-31'],
        ['GMT 674', '2', '1',   'การจัดทำภาพตัดขวางทางธรณีวิทยา',  '2016-01-01',  '2016-12-31'],
        ['GMT 674', '2', '2',   'การวางแผนงานเพื่อเก็บตัวอย่างด้านธรณีวิทยา',  '2016-01-01',  '2016-12-31'],
        ['GMT 674', '2', '3',   'การสำรวจเพิ่มเติมด้านธรณีวิทยา',  '2016-01-01',  '2016-12-31'],
        ['GMT 674', '2', '4',   'การจัดเตรียมเอกสารประกอบการเก็บตัวอย่าง', '2016-01-01',  '2016-12-31'],
        ['GMT 674', '2', '5',   'การตรวจสอบตัวอย่างด้านธรณีวิทยา', '2016-01-01',  '2016-12-31'],
        ['GMT 674', '2', '6',   'งานต่างๆ ที่ได้รับมอบหมายด้านธรณีวิทยา',  '2016-01-01',  '2016-12-31'],
        ['GMT 674', '3', '1',   'การวางแผนงานเพื่อเก็บตัวอย่างด้านอุทกธรณีวิทยา',  '2016-01-01',  '2016-12-31'],
        ['GMT 674', '3', '2',   'การจัดเตรียมเอกสารประกอบการเก็บตัวอย่าง', '2016-01-01',  '2016-12-31'],
        ['GMT 674', '3', '3',   'การตรวจสอบตัวอย่างด้านอุทกธรณีวิทยา', '2016-01-01',  '2016-12-31'],
        ['GMT 674', '3', '4',   'การสำรวจเพิ่มเติมด้านอุทกธรณีวิทยา',  '2016-01-01',  '2016-12-31'],
        ['GMT 674', '3', '5',   'งานต่างๆ ที่ได้รับมอบหมายด้านอุทกธรณีวิทยา',  '2016-01-01',  '2016-12-31'],
        ['GMT 674', '4', '1',   'การวางแผนงานเพื่อเก็บตัวอย่างด้านสิ่งแวดล้อม',    '2016-01-01',  '2016-12-31'],
        ['GMT 674', '4', '2',   'การจัดเตรียมเอกสารประกอบการเก็บตัวอย่าง', '2016-01-01',  '2016-12-31'],
        ['GMT 674', '4', '3',   'การตรวจสอบตัวอย่างด้านสิ่งแวดล้อม',   '2016-01-01',  '2016-12-31'],
        ['GMT 674', '4', '4',   'การกรองตัวอย่างน้ำ',  '2016-01-01',  '2016-12-31'],
        ['GMT 674', '4', '5',   'การสำรวจเพิ่มเติมด้านสิ่งแวดล้อม',    '2016-01-01',  '2016-12-31'],
        ['GMT 674', '4', '6',   'งานต่างๆ ที่ได้รับมอบหมายด้านสิ่งแวดล้อม',    '2016-01-01',  '2016-12-31'],
        ['GMT 674', '5', '1',   'งานต่างๆ ที่ได้รับมอบหมายด้านสารสนเทศภูมิศาสตร์และการจัดทำระบบฐานข้อมูล', '2016-01-01',  '2016-12-31'],
        ['GMT 674', '5', '2',   'เช่น การจัดทำแผนที่เพื่อวิเคราะห์ข้อมูล', '2016-01-01',  '2016-12-31'],
        ['GMT 674', '6', '1',   'การปลิ้นท์และเข้าเล่มรายงาน', '2016-01-01',  '2016-12-31'],
        ['GMT 674', '6', '2',   'การติดต่อประสานงานต่างๆ เช่น การข้อมูลจากหน่วยงานต่างๆ ที่เกี่ยวข้อง',    '2016-01-01',  '2016-12-31'],
        ['GMT 674', '6', '3',   'การติดต่อประสานงานกับเจ้าหน้าที่จากหน่วยงานที่เกี่ยวข้อง',    '2016-01-01',  '2016-12-31'],
        ['GMT 674', '6', '4',   'การซ่อมบำรุงรักษรถยนต์',  '2016-01-01',  '2016-12-31'],
        ['GMT 690', '1', '1',   'ตรวจสอบแก้ไขรายงาน (ครั้งที่1)',  '2016-01-01',  '2016-12-31'],
        ['GMT 690', '1', '2',   'ตรวจสอบแก้ไขรายงาน (ครั้งที่2)',  '2016-01-01',  '2016-12-31'],
        ['GMT 690', '2', '1',   'รายงานฉบับสมบูรณ์ (Final Report)',    '2016-01-01',  '2016-12-31'],
        ['GMT 690', '3', '1',   'ประชุมโครงการ',   '2016-01-01',  '2016-12-31'],
        ['GMT 692', '1', '0',   'งานออกภาคสนาม',   '2016-01-01',  '2016-12-31'],
        ['GMT 692', '1', '1',   'งานเก็บดินระดับตื้น รวมจำนวน 60 เมตร',    '2016-01-01',  '2016-12-31'],
        ['GMT 692', '1', '2',   'งานขุดหลุมทดสอบ รวมจำนวนจำนวน 15 บ่อ',    '2016-01-01',  '2016-12-31'],
        ['GMT 692', '1', '3',   'งานเจาะสำรวจ รวมจำนวน 626 เมตร',  '2016-01-01',  '2016-12-31'],
        ['GMT 692', '2', '1',   'จัดทำรายงาน', '2016-01-01',  '2016-12-31'],
      ];

      // Insert
      foreach($departments as $department)
      {
        $department['active'] = 1;
        Department::create($department);
      }

      foreach($positions as $position)
      {
        $input                  = [];
        $code                   = isset($position['department_code']) ? $position['department_code'] : '000';
        $input['department_id'] = Department::where('code', $code)->first()->id;
        $input['name']          = $position['name'];
        Position::create($input);
      }

      foreach($employees['employee_id'] as $index => $empCode)
      {
        $departmentCode = isset($employees['department_id'][$index])? $employees['department_id'][$index] : '000';

        $input                  = [];
        $input['code']          = $empCode;
        $input['firstname']     = $employees['fullname'][$index]['firstname'];
        $input['lastname']      = $employees['fullname'][$index]['lastname'];
        $input['can_login']     = true;
        $input['department_id'] = Department::where('code', $departmentCode)->first()->id;
        $input['position_id']   = Position::where('name', $employees['position_name'][$index])->first()->id;

        $employee = Employee::create($input);
        $employee->permission()->create([
          'employee_id' => $employee->id,
          'role_id'     => Role::where('name', 'พนักงานทั่วไป')->first()->id
        ]);
      }

      foreach($projects['code'] as $index => $code)
      {
        $input                  = [];
        $input['code']          = $code;
        $input['name']          = $projects['name'][$index];
        $input['start_date']    = '2016-01-01';
        $input['success_date']  = '2016-12-31';
        $input['active']        = true;
        $input['department_id'] = Department::where('code', $projects['department_code'][$index])->first()->id;
        Project::create($input);
      }

      foreach($activities['project_code'] as $index => $code)
      {
        $input                 = [];
        $input['active']       = true;
        $input['project_id']   = Project::where('code', $code)->first()->id;
        $input['name']         = $activities['name'][$index];
        $input['sequence']     = (int) $activities['sequence'][$index];
        $input['sub_sequence'] = (int) $activities['sub'][$index];
        $input['start_date']   = '2016-01-01';
        $input['end_date'] = '2016-12-31';
        ProjectActivity::create($input);
      }
    }
}
