<?php

use Illuminate\Database\Seeder;
use App\Model\Project;
use App\Model\ProjectActivity;

class NewActivity extends Seeder
{
  /**
   * Run the database seeds.
   *
   * @return void
   */
  public function run()
  {
    $newActivities = [
      ['GMT 672', '1', '1',   'รายงานความก้าวหน้าครั้งที่ 1 (inception report)', '2016-01-01',  '2016-12-31'],
      ['GMT 672', '1', '2',   'รายงานความก้าวหน้าครั้งที่ 2 (prog 1)',   '2016-01-01',  '2016-12-31'],
      ['GMT 672', '1', '3',   'รายงานความก้าวหน้าครั้งที่ 3 (prog 2)',   '2016-01-01',  '2016-12-31'],
      ['GMT 672', '1', '4',   'รายงานความก้าวหน้าครั้งที่ 4 (prog 3)',   '2016-01-01',  '2016-12-31'],
      ['GMT 672', '1', '5',   'รายงานความก้าวหน้าครั้งที่ 5 (prog 4)',   '2016-01-01',  '2016-12-31'],
      ['GMT 672', '1', '6',   'ร่างรายงานฉบับสมบูรณ์ (Draft Final Report)',  '2016-01-01',  '2016-12-31'],
      ['GMT 672', '1', '7',   'รายงานฉบับสมบูรณ์ (Final Report)',    '2016-01-01',  '2016-12-31'],
      ['GMT 672', '1', '8',   'รายงานฉบับผู้บริหาร', '2016-01-01',  '2016-12-31'],
      ['GMT 672', '1', '9',   'จัดทำรายงานความก้าวหน้าประจำเดือน',   '2016-01-01',  '2016-12-31'],
      ['GMT 672', '1', '10',  'จัดทำภาคผนวก หรือแฟ้มข้อมูลดิบข้อมูลงานสนาม', '2016-01-01',  '2016-12-31'],
      ['GMT 672', '1', '1',   'งานศึกษา รวบรวมและวิเคราะห์ข้อมูลทุติยภูมิ',  '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '2',   'งานสำรวจการใช้น้ำบาดาลและความต้องการใช้น้ำบาดาล 750 หมู่บ้าน',    '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '3',   'งานสำรวจสถานภาพบ่อน้ำบาดาล 1500 บ่อ',     '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '4',   'งานสำรวจธรณีฟิสิกส์บนผิวดิน ตามรูปแบบชลัมเบอร์เจอร์ 1750 จุด',    '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '5',   'งานสำรวจธรณีฟิสิกส์บนผิวดินแบบภาคตัดขวาง 750 จุด',    '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '6',   'งานสูบทดสอบปริมาณน้ำ (บ่อน้ำบาดาลเดิม) 250 บ่อ',      '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '7',   'งานหยั่งธรณีหลุมเจาะโดยใช้ Gamma Ray Log 250 บ่อ',    '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '8',   'งานเจาะบ่อสำรวจแบบเก็บตัวอย่างตะกอนเศษหิน  20 บ่อ 3000 เมตร', '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '9',   'งานเจาะและก่อสร้างบ่อสังเกตการณ์ 20 บ่อ 1200 ม',  '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '10',  'งานวิเคราะห์ ดิน หิน ตัวอย่าง ทุกระยะ 1  เมตร 4,200 เมตร',    '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '11',  'งานหยั่งธรณีฟิสิกส์ในหลุมเจาะของบ่อเจาะสำรวจใหม่และบ่อสังเกตการณ์ 43 บ่อ',    '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '12',  'งานจัดทำรั้วสำหรับบ่อสังเกตการณ์  20 บ่อ',    '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '13',  'งานสูบทดสอบปริมาณน้ำบ่อเจาะใหม่ 20 บ่อ',  '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '14',  'งานเก็บตัวอย่างน้ำบาดาล 40 ตัวอย่าง (บ่อเจาะสำรวจ 20 ตย บ่อสังเกตการณ์ 20 ตย)',   '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '15',  'งานเจาะบ่อสำรวจแบบเก็บแท่งตัวอย่างหิน  450 เมตร',     '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '16',  'งานวิเคราะห์ ดิน หิน ตัวอย่างจากการเจาะบ่อสำรวจแบบเก็บแท่งตัวอย่างหิน ทุกระยะ 1  เมตร 450 เมตร',  '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '17',  'งานรังวัดปากบ่อแบบ GPS ไม่น้อยกว่า 1,540 บ่อ',    '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '18',  'งานตรวจสอบข้อมูลงานสนาม', '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '19',  'ขับรถรับส่งในสนาม',   '2016-01-01',  '2016-12-31'],
      ['GMT 672', '2', '1',   'งานวิเคราะห์ แปลความหมายและประมวลผลข้อมูลต่างๆ',      '2016-01-01',  '2016-12-31'],
      ['GMT 672', '3', '2',   'งานจัดทำระดับชั้นข้อมูลสารสนเทศทางอุทกธรณีวิทยา',     '2016-01-01',  '2016-12-31'],
      ['GMT 672', '3', '3',   'งานฝึกอบรมภายในประเทศโปรแกรมคอม 3 มิติ',      '2016-01-01',  '2016-12-31'],
      ['GMT 672', '3', '4',   'งานจัดทำแผนที่อุทกธรณีวิทยาและแผนที่น้ำบาดาล',    '2016-01-01',  '2016-12-31'],
      ['GMT 672', '3', '5',   'งานพิมพ์แผนที่อุทกธรณีวิทยาและแผนที่น้ำบาดาล',    '2016-01-01',  '2016-12-31'],
      ['GMT 672', '3', '6',   'งานจัดทำระบบฐานข้อมูลสารสนเทศทางอุทกธรณีวิทยา',   '2016-01-01',  '2016-12-31'],
      ['GMT 672', '3', '7',   'งานแบบจำลองทางอุทกธรณีวิทยา', '2016-01-01',  '2016-12-31'],
      ['GMT 672', '3', '8',   'จัดทำฐานข้อมูลแบบจำลองทางอุทกธรณีวิทยา',  '2016-01-01',  '2016-12-31'],
      ['GMT 672', '3', '9',   'จัดทำและประมวลผลแบบจำลองทางอุทกธรณีวิทยา',    '2016-01-01',  '2016-12-31'],
      ['GMT 672', '3', '10',  'ประชุมสัมมนาโครงการครั้งที่ 1',   '2016-01-01',  '2016-12-31'],
      ['GMT 672', '3', '11',  'ประชุมสัมมนาโครงการครั้งที่ 2',   '2016-01-01',  '2016-12-31'],
      ['GMT 672', '4', '1',   'ประชุมเสนอแผนงาน  ตรวจรับงานที่กรมทรัพยากรน้ำบาดาล',  '2016-01-01',  '2016-12-31'],
      ['GMT 672', '4', '2',   'ประชุมโครงการ',   '2016-01-01',  '2016-12-31'],
      ['GMT 672', '4', '3',   'ติดต่อ ประสานงาน',    '2016-01-01',  '2016-12-31'],
      ['GMT 674', '1', '1',   'การวางแผนการดำเนินงานโครงการฯ',   '2016-01-01',  '2016-12-31'],
      ['GMT 674', '1', '2',   'การประชุมภายในโครงการฯ',  '2016-01-01',  '2016-12-31'],
      ['GMT 674', '1', '3',   'การตรวจสอบการดำเนินงานภาคสนาม',   '2016-01-01',  '2016-12-31'],
      ['GMT 674', '1', '4',   'การจัดทำรายรับ-รายจ่าย (สุทธิ) โครงการฯ', '2016-01-01',  '2016-12-31'],
      ['GMT 674', '1', '5',   'การจัดทำเอกสารประชุมความก้าวหน้าโครงการฯ',    '2016-01-01',  '2016-12-31'],
      ['GMT 674', '2', '1',   'การจัดทำภาพตัดขวางทางธรณีวิทยา',  '2016-01-01',  '2016-12-31'],
      ['GMT 674', '2', '2',   'การวางแผนงานเพื่อเก็บตัวอย่างด้านธรณีวิทยา',  '2016-01-01',  '2016-12-31'],
      ['GMT 674', '2', '3',   'การสำรวจเพิ่มเติมด้านธรณีวิทยา',  '2016-01-01',  '2016-12-31'],
      ['GMT 674', '2', '4',   'การจัดเตรียมเอกสารประกอบการเก็บตัวอย่าง', '2016-01-01',  '2016-12-31'],
      ['GMT 674', '2', '5',   'การตรวจสอบตัวอย่างด้านธรณีวิทยา', '2016-01-01',  '2016-12-31'],
      ['GMT 674', '2', '6',   'งานต่างๆ ที่ได้รับมอบหมายด้านธรณีวิทยา',  '2016-01-01',  '2016-12-31'],
      ['GMT 674', '3', '1',   'การวางแผนงานเพื่อเก็บตัวอย่างด้านอุทกธรณีวิทยา',  '2016-01-01',  '2016-12-31'],
      ['GMT 674', '3', '2',   'การจัดเตรียมเอกสารประกอบการเก็บตัวอย่าง', '2016-01-01',  '2016-12-31'],
      ['GMT 674', '3', '3',   'การตรวจสอบตัวอย่างด้านอุทกธรณีวิทยา', '2016-01-01',  '2016-12-31'],
      ['GMT 674', '3', '4',   'การสำรวจเพิ่มเติมด้านอุทกธรณีวิทยา',  '2016-01-01',  '2016-12-31'],
      ['GMT 674', '3', '5',   'งานต่างๆ ที่ได้รับมอบหมายด้านอุทกธรณีวิทยา',  '2016-01-01',  '2016-12-31'],
      ['GMT 674', '4', '1',   'การวางแผนงานเพื่อเก็บตัวอย่างด้านสิ่งแวดล้อม',    '2016-01-01',  '2016-12-31'],
      ['GMT 674', '4', '2',   'การจัดเตรียมเอกสารประกอบการเก็บตัวอย่าง', '2016-01-01',  '2016-12-31'],
      ['GMT 674', '4', '3',   'การตรวจสอบตัวอย่างด้านสิ่งแวดล้อม',   '2016-01-01',  '2016-12-31'],
      ['GMT 674', '4', '4',   'การกรองตัวอย่างน้ำ',  '2016-01-01',  '2016-12-31'],
      ['GMT 674', '4', '5',   'การสำรวจเพิ่มเติมด้านสิ่งแวดล้อม',    '2016-01-01',  '2016-12-31'],
      ['GMT 674', '4', '6',   'งานต่างๆ ที่ได้รับมอบหมายด้านสิ่งแวดล้อม',    '2016-01-01',  '2016-12-31'],
      ['GMT 674', '5', '1',   'งานต่างๆ ที่ได้รับมอบหมายด้านสารสนเทศภูมิศาสตร์และการจัดทำระบบฐานข้อมูล', '2016-01-01',  '2016-12-31'],
      ['GMT 674', '5', '2',   'เช่น การจัดทำแผนที่เพื่อวิเคราะห์ข้อมูล', '2016-01-01',  '2016-12-31'],
      ['GMT 674', '6', '1',   'การปลิ้นท์และเข้าเล่มรายงาน', '2016-01-01',  '2016-12-31'],
      ['GMT 674', '6', '2',   'การติดต่อประสานงานต่างๆ เช่น การข้อมูลจากหน่วยงานต่างๆ ที่เกี่ยวข้อง',    '2016-01-01',  '2016-12-31'],
      ['GMT 674', '6', '3',   'การติดต่อประสานงานกับเจ้าหน้าที่จากหน่วยงานที่เกี่ยวข้อง',    '2016-01-01',  '2016-12-31'],
      ['GMT 674', '6', '4',   'การซ่อมบำรุงรักษรถยนต์',  '2016-01-01',  '2016-12-31'],
      ['GMT 690', '1', '1',   'ตรวจสอบแก้ไขรายงาน (ครั้งที่1)',  '2016-01-01',  '2016-12-31'],
      ['GMT 690', '1', '2',   'ตรวจสอบแก้ไขรายงาน (ครั้งที่2)',  '2016-01-01',  '2016-12-31'],
      ['GMT 690', '2', '1',   'รายงานฉบับสมบูรณ์ (Final Report)',    '2016-01-01',  '2016-12-31'],
      ['GMT 690', '3', '1',   'ประชุมโครงการ',   '2016-01-01',  '2016-12-31'],
      ['GMT 692', '1', '0',   'งานออกภาคสนาม',   '2016-01-01',  '2016-12-31'],
      ['GMT 692', '1', '1',   'งานเก็บดินระดับตื้น รวมจำนวน 60 เมตร',    '2016-01-01',  '2016-12-31'],
      ['GMT 692', '1', '2',   'งานขุดหลุมทดสอบ รวมจำนวนจำนวน 15 บ่อ',    '2016-01-01',  '2016-12-31'],
      ['GMT 692', '1', '3',   'งานเจาะสำรวจ รวมจำนวน 626 เมตร',  '2016-01-01',  '2016-12-31'],
      ['GMT 692', '2', '1',   'จัดทำรายงาน', '2016-01-01',  '2016-12-31'],
    ];

    foreach($newActivities as $activity)
    {
      $projectID = Project::where('code', $activity[0])->pluck('id');
      $add = [
        'project_id' => $projectID[0],
        'sequence' => (int) $activity[1],
        'sub_sequence' => (int) $activity[2],
        'name' => $activity[3],
        'start_date' => $activity[4],
        'end_date' => $activity[5],
        'active' => true,
      ];
      ProjectActivity::create($add);
    }
  }
}
